Bialystok-Dynamics/Dzik1-STM32-G0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define T_NRST_Pin GPIO_PIN_2
#define T_NRST_GPIO_Port GPIOF
#define T_VCP_TX_Pin GPIO_PIN_2
#define T_VCP_TX_GPIO_Port GPIOA
#define T_VCP_RX_Pin GPIO_PIN_3
#define T_VCP_RX_GPIO_Port GPIOA
#define TIM3_CH2_SERVO_L3_Pin GPIO_PIN_7
#define TIM3_CH2_SERVO_L3_GPIO_Port GPIOA
#define TIM3_CH3_POLOLU_P_Pin GPIO_PIN_0
#define TIM3_CH3_POLOLU_P_GPIO_Port GPIOB
#define TIM3_CH4_POLOLI_L_Pin GPIO_PIN_1
#define TIM3_CH4_POLOLI_L_GPIO_Port GPIOB
#define TIM1_CH1_SERVO_P1_Pin GPIO_PIN_8
#define TIM1_CH1_SERVO_P1_GPIO_Port GPIOA
#define TIM1_CH4_SERVO_L2_Pin GPIO_PIN_11
#define TIM1_CH4_SERVO_L2_GPIO_Port GPIOA
#define T_JTMS_Pin GPIO_PIN_13
#define T_JTMS_GPIO_Port GPIOA
#define T_JTCK_Pin GPIO_PIN_14
#define T_JTCK_GPIO_Port GPIOA
#define TIM1_CH2_SERVO_L1_Pin GPIO_PIN_3
#define TIM1_CH2_SERVO_L1_GPIO_Port GPIOB
#define TIM3_CH1_SERVO_P3_Pin GPIO_PIN_4
#define TIM3_CH1_SERVO_P3_GPIO_Port GPIOB
#define TIM1_CH3_SERVO_P2_Pin GPIO_PIN_6
#define TIM1_CH3_SERVO_P2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
